//
//  exampleText.swift
//  LabelAppOne
//
//  Created by Александр Николаевич on 28.01.2022.
//

import Foundation

let exampleText = "Swift появился в 2014 году. Создателем языка программирования является компания Apple. Согласно заявлениям официальных представителей, Свифт был заложен в платформе NeXT, которая выпускалась в начале 90-х годов прошлого столетия. Именно эта платформа и стала прародительницей современный iOS и macOS. Разработкой текущей версии языка сотрудники Apple занимались еще с 2010 года. Примечательно, что этот язык не имеет как такового одного «родителя». Вместо этого, создатели Swift взяли понемногу от разных языков, например, Object-C, Haskell, Python, C#, CLU и ряда других. Презентация Свифт состоялась в 2014 году. В это же время разработчикам стала доступна официальная документация по языку на 500 страницах печатного текста. Ровно спустя один год вышла вторая версия Swift. В отличие от первой она стала более производительной. В 2019 году вышла последняя на данный момент 5 версия ЯП."
